Revit 2027 API
ExternallyTaggedGeometryObject.ExternalId Property
 The external Id of the geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalGeometryId ExternalId { get; }
Public ReadOnly Property ExternalId As ExternalGeometryId
	Get
public:
property ExternalGeometryId^ ExternalId {
	ExternalGeometryId^ get ();
}
member ExternalId : ExternalGeometryId with get
Property Value
ExternalGeometryId
See Also
Reference
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace